{
  "auto_mapping": null,
  "base_model_name_or_path": "meta-llama/Llama-3.2-3B",
  "inference_mode": true,
  "modules_to_save": null,
  "noise_alpha": 0.01,
  "noise_step_interval": 5,
  "peft_type": "CARA",
  "peft_version": "0.18.2.dev0@UNKNOWN",
  "r": 32,
  "revision": null,
  "target_modules": [
    "v_proj",
    "q_proj"
  ],
  "task_type": "CAUSAL_LM"
}